app/controllers/users_controller.rb

INSERT INTO "users" ("name", "encrypted_password", "salt", "updated_at", "admin", "remember_token", "email", "created_at") VALUES('Brian Swedenberg', '9462789611bc1e026d161176d04e82ad8ef4581a05642ed681c409316bf68414', 'fe9a9f563bf92f625199edb4ce3f8d30429ab64c78179dd1b730e575c3e04b45', '2010-05-11 20:03:14', NULL, NULL, 'brian@email.com', '2010-05-11 20:03:14')
---
  def create
	@user = User.new(params[:user])
	if @user.save

UPDATE "users" SET "updated_at" = '2010-05-04 23:09:34', "encrypted_password" = '35ea2161f0c76cd6be14dd09982e23e0742f0ce38824c75bed1040267534e701', "salt" = 'bdb041abf967044fe7a27b621fb65bb49b83b526df4002491bb48777712bf27e' WHERE "id" = 2
---
  def update
	if @user.update_attributes(params[:user])

SELECT * FROM "users" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "users"
---
  def index
	@title = "All users"
	@users = User.paginate(:page => params[:page])